app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
	if (params[:expand_merchants].present?) && (params[:expand_merchants] == "1")
		# this line may need to be edited in the futute to remove the to_json
		# so that changes can be made after this if statement but before the render
		@categories = Category.includes(:merchants).order("categories.name ASC, merchants.name ASC").to_json(:include => { merchants: {only: [:name, :id]}})

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 21 Sep 2013 03:48:27 UTC +00:00], ["name", "MyString"], ["updated_at", Sat, 21 Sep 2013 03:48:27 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    if @category.save