app/controllers/coupons_controller.rb

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @coupon = Coupon.find(params[:id])

INSERT INTO "coupons" ("begin_date", "created_at", "created_date", "description", "end_date", "hidden", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @coupon = Coupon.new(params[:coupon])

    if @coupon.save

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @coupon = Coupon.find(params[:id])