app/controllers/merchants_controller.rb

INSERT INTO "merchants" ("approved", "created_at", "description", "email", "hours", "link", "name", "phone", "price_range", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if @merchant.save